"""Спринт 02, задание 02: списки."""

# Задание 1.
# Создай пустой список products.
# В цикле спрашивай название товара, пока пользователь не введёт stop.
# Каждый товар добавляй в список через .append().
# После stop выведи список.


# Задание 2.
# Даны цены:
# prices = [10.5, 20, 7.99, 100]
# Через цикл посчитай общую сумму без sum().


# Задание 3.
# Для списка prices из задания 2 выведи только цены больше 15.


# Задание 4.
# Даны товары:
# products = ["milk", "bread", "milk", "apple"]
# Посчитай, сколько раз встречается "milk", без использования .count().


# Задание 5.
# Спроси у пользователя 5 чисел.
# Добавь их в список.
# После этого выведи:
# - сам список;
# - самое большое число;
# - самое маленькое число.
# Можно использовать max() и min().


# Задание 6.
# Даны товары:
# cart = ["milk", "bread", "apple"]
# Спроси, какой товар удалить.
# Если товар есть в списке — удали его и выведи обновлённый список.
# Если товара нет — выведи "Item not found".

